app/views/gifs/_gif.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 8]]
SELECT "tags".* FROM "tags" INNER JOIN "gifs_tags" ON "tags"."id" = "gifs_tags"."tag_id" WHERE "gifs_tags"."gif_id" = $1  [["gif_id", 13]]
---
<%= link_to image_tag(gif.image_url), gif_path(gif.id) %><br>
GifMe made by <%= link_to "#{User.find(gif.user_id).username}", user_path(gif.user_id) %>  ||  Created on <%= gif.created_at.localtime.strftime("%I:%M%p on %m/%d/%Y") %><br>
Tags:
<% gif.tags.each do |tag| %>