app/views/gifs/show.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."gif_id" = $1  ORDER BY "comments"."created_at" DESC  [["gif_id", 1]]
---
		<div>
		<% @gif.comments.order(created_at: :desc).each do |comment| %>