app/views/users/_form.html.erb

SELECT "profile_pictures".* FROM "profile_pictures"
---
<div class="input">
<%= label_tag "Profile Picture" %><br><%= collection_select(:user, :profile_picture_id, ProfilePicture.all, :id, :name, prompt: true) %><br>