app/views/users/show.html.erb

SELECT  "profile_pictures".* FROM "profile_pictures"  WHERE "profile_pictures"."id" = $1 LIMIT 1  [["id", 33]]
---
		<div id="uinfophoto">
			<img src=" <%= ProfilePicture.find(@user.profile_picture_id).image_url %> " style="height: 300px; border-radius: 50%;"/>

SELECT "gifs".* FROM "gifs"  WHERE "gifs"."user_id" = $1  ORDER BY "gifs"."created_at" DESC  [["user_id", 4]]
---
		<h2>Your Gifs</h2>
		<% @user.gifs.order(created_at: :desc).each do |gif| %>