app/controllers/gifs_controller.rb

	def index
		@gif = Gif.order(created_at: :desc)
---
SELECT "gifs".* FROM "gifs"   ORDER BY "gifs"."created_at" DESC

	def show
		@gif = Gif.find(params[:id])
---
SELECT  "gifs".* FROM "gifs"  WHERE "gifs"."id" = $1 LIMIT 1  [["id", 1]]

	def create
		cloudconverturl = "https://api.cloudconvert.com/convert?apikey=#{ ENV['CLOUD_CONVERT_KEY'] }&input=download&download=inline&inputformat=mp4&outputformat=gif&file=https%3A%2F%2Fembed.ziggeo.com%2Fv1%2Fapplications%2F#{ ENV['ZIGGEO_APPLICATION_TOKEN'] }%2Fvideos%2F#{params[:videotoken]}%2Fvideo.mp4&converteroptions[video_resolution]=480x320&converteroptions[video_fps]=5"
		conv = HTTParty.get(cloudconverturl)
		sleep(1)
		value = HTTParty.get("https://api.cloudconvert.com/processes?apikey=#{ ENV['CLOUD_CONVERT_KEY'] }")[-1].values[5]
		url = value.gsub("process", "download")
		gif_url = ("https:#{url}?inline")

		@gif = Gif.create({
												image_url: gif_url,
												user_id: session[:current_user_id]
		})

		tag_one = Tag.find_or_create_by({
													 name: "#{params[:tag_one]}"
		})
---
INSERT INTO "gifs" ("created_at", "image_url", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-05 09:45:35.547563"], ["image_url", "https://l5.cloudconvert.com/download/xsIuRm15NbtwSj4yOk6P?inline"], ["updated_at", "2014-12-05 09:45:35.547563"], ["user_id", 11]]
INSERT INTO "gifs_tags" ("gif_id", "tag_id") VALUES ($1, $2)  [["gif_id", 1], ["tag_id", 1]]
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-05 09:45:35.659872"], ["name", "night"], ["updated_at", "2014-12-05 09:45:35.659872"]]
SELECT  "tags".* FROM "tags"  WHERE "tags"."name" = 'night' LIMIT 1

	def destroy
		@gif = Gif.find(params[:id])
		if @gif.user_id != session[:current_user_id]
			redirect_to user_path(session[:current_user_id])
		else @gif.destroy
---
SELECT  "gifs".* FROM "gifs"  WHERE "gifs"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "gifs" WHERE "gifs"."id" = $1  [["id", 1]]