app/controllers/users_controller.rb

INSERT INTO "users" ("bio", "created_at", "password_digest", "profile_picture_id", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "users" SET "bio" = $1, "updated_at" = $2 WHERE "users"."id" = 11  [["bio", "This is my info now deal with it"], ["updated_at", "2014-12-05 05:46:25.798824"]]
---
	def update
		@user = User.find(params[:id])
		if @user != current_user
			redirect_to user_path(session[:current_user_id])
		else
			if @user.update(user_params)